{
  "_name_or_path": "microsoft/layoutlmv3-base",
  "architectures": [
    "LayoutLMv3ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "coordinate_size": 128,
  "eos_token_id": 2,
  "has_relative_attention_bias": true,
  "has_spatial_attention_bias": true,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-menu.cnt",
    "1": "B-menu.discountprice",
    "2": "B-menu.etc",
    "3": "B-menu.itemsubtotal",
    "4": "B-menu.nm",
    "5": "B-menu.num",
    "6": "B-menu.price",
    "7": "B-menu.sub_cnt",
    "8": "B-menu.sub_etc",
    "9": "B-menu.sub_nm",
    "10": "B-menu.sub_price",
    "11": "B-menu.sub_unitprice",
    "12": "B-menu.unitprice",
    "13": "B-menu.vatyn",
    "14": "B-sub_total.discount_price",
    "15": "B-sub_total.etc",
    "16": "B-sub_total.othersvc_price",
    "17": "B-sub_total.service_price",
    "18": "B-sub_total.subtotal_price",
    "19": "B-sub_total.tax_price",
    "20": "B-total.cashprice",
    "21": "B-total.changeprice",
    "22": "B-total.creditcardprice",
    "23": "B-total.emoneyprice",
    "24": "B-total.menuqty_cnt",
    "25": "B-total.menutype_cnt",
    "26": "B-total.total_etc",
    "27": "B-total.total_price",
    "28": "B-void_menu.nm",
    "29": "B-void_menu.price",
    "30": "I-menu.cnt",
    "31": "I-menu.discountprice",
    "32": "I-menu.etc",
    "33": "I-menu.itemsubtotal",
    "34": "I-menu.nm",
    "35": "I-menu.num",
    "36": "I-menu.price",
    "37": "I-menu.sub_cnt",
    "38": "I-menu.sub_etc",
    "39": "I-menu.sub_nm",
    "40": "I-menu.sub_price",
    "41": "I-menu.sub_unitprice",
    "42": "I-menu.unitprice",
    "43": "I-menu.vatyn",
    "44": "I-sub_total.discount_price",
    "45": "I-sub_total.etc",
    "46": "I-sub_total.othersvc_price",
    "47": "I-sub_total.service_price",
    "48": "I-sub_total.subtotal_price",
    "49": "I-sub_total.tax_price",
    "50": "I-total.cashprice",
    "51": "I-total.changeprice",
    "52": "I-total.creditcardprice",
    "53": "I-total.emoneyprice",
    "54": "I-total.menuqty_cnt",
    "55": "I-total.menutype_cnt",
    "56": "I-total.total_etc",
    "57": "I-total.total_price",
    "58": "I-void_menu.nm",
    "59": "I-void_menu.price"
  },
  "initializer_range": 0.02,
  "input_size": 224,
  "intermediate_size": 3072,
  "label2id": {
    "B-menu.cnt": 0,
    "B-menu.discountprice": 1,
    "B-menu.etc": 2,
    "B-menu.itemsubtotal": 3,
    "B-menu.nm": 4,
    "B-menu.num": 5,
    "B-menu.price": 6,
    "B-menu.sub_cnt": 7,
    "B-menu.sub_etc": 8,
    "B-menu.sub_nm": 9,
    "B-menu.sub_price": 10,
    "B-menu.sub_unitprice": 11,
    "B-menu.unitprice": 12,
    "B-menu.vatyn": 13,
    "B-sub_total.discount_price": 14,
    "B-sub_total.etc": 15,
    "B-sub_total.othersvc_price": 16,
    "B-sub_total.service_price": 17,
    "B-sub_total.subtotal_price": 18,
    "B-sub_total.tax_price": 19,
    "B-total.cashprice": 20,
    "B-total.changeprice": 21,
    "B-total.creditcardprice": 22,
    "B-total.emoneyprice": 23,
    "B-total.menuqty_cnt": 24,
    "B-total.menutype_cnt": 25,
    "B-total.total_etc": 26,
    "B-total.total_price": 27,
    "B-void_menu.nm": 28,
    "B-void_menu.price": 29,
    "I-menu.cnt": 30,
    "I-menu.discountprice": 31,
    "I-menu.etc": 32,
    "I-menu.itemsubtotal": 33,
    "I-menu.nm": 34,
    "I-menu.num": 35,
    "I-menu.price": 36,
    "I-menu.sub_cnt": 37,
    "I-menu.sub_etc": 38,
    "I-menu.sub_nm": 39,
    "I-menu.sub_price": 40,
    "I-menu.sub_unitprice": 41,
    "I-menu.unitprice": 42,
    "I-menu.vatyn": 43,
    "I-sub_total.discount_price": 44,
    "I-sub_total.etc": 45,
    "I-sub_total.othersvc_price": 46,
    "I-sub_total.service_price": 47,
    "I-sub_total.subtotal_price": 48,
    "I-sub_total.tax_price": 49,
    "I-total.cashprice": 50,
    "I-total.changeprice": 51,
    "I-total.creditcardprice": 52,
    "I-total.emoneyprice": 53,
    "I-total.menuqty_cnt": 54,
    "I-total.menutype_cnt": 55,
    "I-total.total_etc": 56,
    "I-total.total_price": 57,
    "I-void_menu.nm": 58,
    "I-void_menu.price": 59
  },
  "layer_norm_eps": 1e-05,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 514,
  "max_rel_2d_pos": 256,
  "max_rel_pos": 128,
  "model_type": "layoutlmv3",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "patch_size": 16,
  "rel_2d_pos_bins": 64,
  "rel_pos_bins": 32,
  "second_input_size": 112,
  "shape_size": 128,
  "text_embed": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 1,
  "visual_embed": true,
  "vocab_size": 50265
}
